# Отчет по лабораторной работе N 12 по курсу
# "Фундаментальная информатика"

Студент группы: Боев Савелий Сергеевич, M80-107Б\
Контакты: bogsava123@gmail.com  telegram: @muuuusor\
Работа выполнена: 25.12.2021\
Преподаватель: Найденов Иван Евгеньевич


## 1. Тема

Техника работы с целыми числами. Системы счисления.

## 2. Цель работы

Составление и отладка программы на языке C для работы с целыми числами.

## 3. Задание

Составить программу, выполняющую указанное действие для всех чисел, поступающих на вход. Требуется удалить все цифры на чётных позициях. При решении задачи необходимо использовать методы работы с находящимися в памяти целыми числами. Все подаваемые на вход числа зачитываются в переменную типа int. Запрещено использовать любые методы работы с изображением числа (как в ЛР №11) и использовать массивы, строки или указатели. Использовать типы размера большего чем у int разрешается только если это необходимо для успешного выполнения задания с учётом всех ограничений.

## 4. Оборудование

Процессор: AMD Ryzen 5 4600H with Radeon Graphics 3.00 GHz\
ОП: 16000 Мб\
НМД: 512 Гб\
Монитор: 1920x1080

## 5. Программное обеспечение

Операционная система семейства: **linux (ubuntu)**, версия **18.10 cosmic**\
Интерпретатор команд: **bash**, версия **4.4.19**.\
Система программирования: **--**, версия **--**\
Редактор текстов: **emacs**, версия **25.2.2**\
Утилиты операционной системы: **--**\
Прикладные системы и программы: **--**\
Местонахождение и имена файлов программ и данных на домашнем компьютере: **--**\

## 6. Идея, метод, алгоритм решения задачи

## 7. Сценарий выполнения работы

| Входные данные | Выходные данные |
| -------------- | --------------- |
|1234567|246|
|-192837|-123|
|+9|0|
|100|0|
|1111|11|
|-0|0|
|123123|132|

## 8. Распечатка протокола

```
#include <stdio.h>

long long preobr(long long num)
{
    long long k = 0, temp = 0, last_num = 0, pr = 1;
    while (num != 0) {
        last_num = num % 10;
        num /= 10;
        k++;
        if (k % 2 == 0) {
            temp += last_num * pr;
            pr *= 10;
        }
    }
    return temp;
}
int main(void)
{
    long long num = 0;
    while (scanf("%lld", &num) != EOF) {
        printf("%lld\n", preobr(num));
    }
    return 0;
}

```

## 9. Дневник отладки

## 10. Замечания автора по существу работы

Замечаний нет.

## 11. Выводы

Было интересно и познавательно.
