# Отчет по лабораторной работе N 14 по курсу
# "Фундаментальная информатика"

Студент группы: Боев Савелий Сергеевич, M80-107Б\
Контакты: bogsava123@gmail.com  telegram: @muuuusor\
Работа выполнена: 18.12.2021\
Преподаватель: Найденов Иван Евгеньевич

## 1. Тема

Вложенные циклы с параметрами. Обход и линеаризация матриц.

## 2. Цель работы

Составить программу ввода квадратной матрицы и печати в строку всех её элементов в заданном порядке обхода.

## 3. Задание

На вход подаётся пакет тестов, содержащий набор квадратных матриц. Каждую матрицу необходимо линеаризовать путём обхода всех её элементов согласно указанному в примере порядку следования.

## 4. Оборудование

Процессор: AMD Ryzen 5 4600H with Radeon Graphics 3.00 GHz\
ОП: 16000 Мб\
НМД: 512 Гб\
Монитор: 1920x1080

## 5. Программное обеспечение

Операционная система семейства: **linux (ubuntu)**, версия **18.10 cosmic**\
Интерпретатор команд: **bash**, версия **4.4.19**.\
Система программирования: **--**, версия **--**\
Редактор текстов: **emacs**, версия **25.2.2**\
Утилиты операционной системы: **--**\
Прикладные системы и программы: **--**\
Местонахождение и имена файлов программ и данных на домашнем компьютере: **--**\

## 6. Идея, метод, алгоритм решения задачи

Алгоритм:

1) Введём квадратную матрицу

2) Выведем главную диагональ матрицы

3) В цикле while будем контролировать уменьшение вывода элементов матрицы и разделим задачу на две подзадачи: вывод двух диагоналей, направленных вверх, и вывод двух диагоналей, направленных вниз

4) Заметим, что начала и концы соответствующих диагоналей получены обменом значений индексов столбца и строки, поэтому в каждом подзадаче в циклах меняем их местами(после вывода одной диагонали)

## 7. Сценарий выполнения работы

| Входные данные | Выходные данные |
| -------------- | --------------- |
|2 4|1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16|
|4|1000|
|1 7 13 15|                        |
|10 2 6 14|                        |
|11 9 3 5|                         |
|16 12 8 4|            |

| Входные данные | Выходные данные |
| -------------- | --------------- |
|1 2|1 4 2 3|
|2| |
|1 2| |
|3 4| |

| Входные данные | Выходные данные |
| -------------- | --------------- |
|2 5|1 5 9 6 2 8 4 7 3|
|3|1 7 13 19 25 20 14 8 2 24 18 12 6 11 17 23 3 9 15 10 4 22|
|1 2 3|16 21 5|
|4 5 6||
|7 8 9||
|5||
|1 2 3 4 5||
|6 7 8 9 10||
|11 12 13 14 15||
|16 17 18 19 20||
|21 22 23 24 25||

## 8. Распечатка протокола
*Подклеить листинг окончательного варианта программы с тестовыми примерами, подписанный преподавателем.*

Сюда вставляем листинг программы, если есть + примеры запуска. Для второй лабы в качестве листинга нужен протокол из терминала в следующем виде:

```
#include <stdio.h>

int main(void)
{
    int n, max;
    scanf("%d%d", &n, &max);
    int a[max][max];
    for (int t = 0; t < n; t++) {
        int cur;
        scanf("%d", &cur);
        for (int i = 0; i < cur; i++) {
            for (int j = 0; j < cur; j++) {
                scanf("%d", &a[i][j]);
            }
        }
        for (int i = 0; i < cur; i++) {
            printf("%d ", a[i][i]);
        }
        int k = 1;
        while (k < cur) {
            for (int i = k; i < cur; i++) {
                printf("%d ", a[cur - i - 1][cur - i + k - 1]);
            }
            for (int i = k; i < cur; i++) {
                printf("%d ", a[cur - i + k - 1][cur - i - 1]);
            }
            k++;
            for (int i = k; i < cur; i++) {
                printf("%d ", a[i][i - k]);
            }
            for (int i = k; i < cur; i++) {
                printf("%d ", a[i - k][i]);
            }
            k++;
        }
        printf("\n");
    }
    return 0;
}
```

## 9. Дневник отладки

## 10. Замечания автора по существу работы

Замечаний нет.

## 11. Выводы

Было интересно работать с матрицами в СИ.
