# Отчет по лабораторной работе N 15 по курсу
# "Фундаментальная информатика"

Студент группы: Боев Савелий Сергеевич, M80-107Б\
Контакты: bogsava123@gmail.com  telegram: @muuuusor\
Работа выполнена: 18.12.2021\
Преподаватель: Найденов Иван Евгеньевич


## 1. Тема

Обработка матриц.

## 2. Цель работы

Составить программу на СИ, производящую обработку квадратной матрицы порядка NxN(1<=N<=8), из целых чисел.

## 3. Задание

На вход подаётся пакет тестов, содержащий набор квадратных матриц. Каждую матрицу, поданную на вход, необходимо обработать согласно заданию: проверка кососимметричности матрицы (сгенерировать матрицу расхождений, где нули записаны на местах кососимметричных элементов).

## 4. Оборудование

Процессор: AMD Ryzen 5 4600H with Radeon Graphics 3.00 GHz\
ОП: 16000 Мб\
НМД: 512 Гб\
Монитор: 1920x1080

## 5. Программное обеспечение

Операционная система семейства: **linux (ubuntu)**, версия **18.10 cosmic**\
Интерпретатор команд: **bash**, версия **4.4.19**.\
Система программирования: **--**, версия **--**\
Редактор текстов: **emacs**, версия **25.2.2**\
Утилиты операционной системы: **--**\
Прикладные системы и программы: **--**\
Местонахождение и имена файлов программ и данных на домашнем компьютере: **--**\

## 6. Идея, метод, алгоритм решения задачи

## 7. Сценарий выполнения работы

| Входные данные | Выходные данные |
| -------------- | --------------- |
|2 3|1 1 1|
|3|1 1 1|
|1 2 3|1 1 1|
|4 5 2|1|
|7 8 1|                         |
|1|            |
|1000|            |

| Входные данные | Выходные данные |
| -------------- | --------------- |
|3 3|1 1 1|
|3|1 1 1|
|1 2 3|1 1 1|
|4 5 6||
|7 8 9|                         |

## 8. Распечатка протокола
*Подклеить листинг окончательного варианта программы с тестовыми примерами, подписанный преподавателем.*

Сюда вставляем листинг программы, если есть + примеры запуска. Для второй лабы в качестве листинга нужен протокол из терминала в следующем виде:

```
#include <stdio.h>

int main(void)
{
    int t, m;
    scanf("%d%d", &t, &m);
    if (t == 0) {
        printf("\n");
    }
    for (int w = 0; w < t; w++) {
        int n;
        scanf("%d", &n);
        if (n == 0) {
            printf("\n");
            continue;
        }
        int a[n][n];
        for (int i = 0; i < n; i++) {
            for (int j = 0; j < n; j++) {
                scanf("%d", &a[i][j]);
            }
        }
        for (int i = 0; i < n; i++) {
            for (int j = 0; j < n; j++) {
                if (a[i][j] == -a[j][i]) {
                    a[i][j] = 0;
                    a[j][i] = 0;
                } else {
                    a[i][j] = 1;
                    a[j][i] = 1;
                }
                printf("%d ", a[i][j]);
            }
            printf("\n");
        }
        printf("\n");
    }
    return 0;
}
```

## 9. Дневник отладки

## 10. Замечания автора по существу работы

Замечаний нет.

## 11. Выводы

Было очень интересно.
