# Отчет по лабораторной работе N 9 по курсу
# "Фундаментальная информатика"

Студент группы: Боев Савелий Сергеевич, M80-107Б\
Контакты: bogsava123@gmail.com  telegram: @Seeempaii\
Работа выполнена: 29.10.2021\
Преподаватель: Найденов Иван Евгеньевич

## 1. Тема

Язык СИ.

## 2. Цель работы

Улучшить навык в работе с СИ.

## 3. Задание

Необходимо определить попадание движущейся по двухмерной целочисленной сетке точки в специальную геометрическую область не более чем за 50 шагов. Передвижение точки определяется специальными формулами и зависит от её текущего положения (i, j), динамического параметра движения l и дискретного времени k. Положение точки на сетке (i0, j0) и значение динамического параметра l0 в нулевой момент времени (k = 0) подаются со стандартного потока ввода. Результатом работы программы является информация о попадании точки в заданную геометрическую область. Вычисления останавливаются при попадании точки в заданную область или при превышении допустимого количества шагов.

Геометрическая область: треугольник с вершинами в точках (−10,0), (0, 10), (−10, 20).

Формулы для вычисления координат и параметра см. в методических указаниях.

## 4. Оборудование

Процессор: AMD Ryzen 5 4600H with Radeon Graphics 3.00 GHz\
ОП: 16000 Мб\
НМД: 512 Гб\
Монитор: 1920x1080

## 5. Программное обеспечение

Операционная система семейства: **linux (ubuntu)**, версия **18.10 cosmic**\
Интерпретатор команд: **bash**, версия **4.4.19**.\
Система программирования: **--**, версия **--**\
Редактор текстов: **emacs**, версия **25.2.2**\
Утилиты операционной системы: **--**\
Прикладные системы и программы: **--**\
Местонахождение и имена файлов программ и данных на домашнем компьютере: **--**\

## 6. Идея, метод, алгоритм решения задачи

## 7. Сценарий выполнения работы

| Входные данные | Выходные данные |
| -------------- | --------------- |
|2 3 1|No 16 275 0 50|
|8 15 10|No 25 514 0 50|
|-5 10 3|Yes -5 10 3 0|

## 8. Распечатка протокола
*Подклеить листинг окончательного варианта программы с тестовыми примерами, подписанный преподавателем.*

Сюда вставляем листинг программы, если есть + примеры запуска. Для второй лабы в качестве листинга нужен протокол из терминала в следующем виде:

```
#include <stdio.h>
#include <math.h>
#include <stdlib.h>
#include <stdbool.h>

int max(int a, int b)
{
    return (a > b) ? a : b;
}

int min(int a, int b)
{
    return (a < b) ? a : b;
}

int mod(int a, int b)
{
    return abs(a - floor(((float) a / b)) * b);
}

int sign(int a)
{
    if (a > 0) {
        return 1;
    }
    if (a < 0) {
        return -1;
    }
    return 0;
}

int Triangle(long long i, long long j)
{
    return (j > i + 10 && i < 0 && i > -10 && j < -i + 10) ? 1 : 0;
}

int main(void)
{
    int i, j, l;
    int k;
    int i2, j2, l2;
    scanf("%d%d%d", &i, &j, &l);
    for (k = 0; k < 50 && Triangle(i, j) == 0; k++) {
        i2 = mod(mod(i + j, abs(min(j - l, l - k)) + 1) - k, 20) + 10;
        j2 = max(floor((float)(i + j) / (2 + sign(j * l - i * k))),
                 floor((float)(j + l) / (2 + sign(i * j - l * k)))) - 10;
        l2 = mod(max(i, j) * min(i, l), 30);

        i = i2;
        j = j2;
        l = l2;
    }
    if (Triangle(i, j)) {
        printf("Yes\n");
        printf("%d %d %d %d\n", i, j, l, k);
    } else {
        printf("No\n");
        printf("%d %d %d %d\n", i, j, l, k);
    }
    return 0;
}
...
```

## 9. Дневник отладки

## 10. Замечания автора по существу работы

Функции это классно.

## 11. Выводы

Самая интересная лаба из всех. Я пролил много пота и крови, пытаясь пофиксить код, чтобы выдавало правильный ответ. Считаю лабу очень полезной для улучшения навыков СИ.
