# Отчет по лабораторной работе N 13 по курсу
# "Фундаментальная информатика"

Студент группы: Боев Савелий Сергеевич, M80-107Б\
Контакты: bogsava123@gmail.com  telegram: @muuuusor\
Работа выполнена: 25.12.2021\
Преподаватель: Найденов Иван Евгеньевич

## 1. Тема

Множества.

## 2. Цель работы

Решить задачу на языке Си при помощи реализации математической абстракции множества

## 3. Задание

На вход подаётся произвольный набор английских слов, разделённых пробелами, запятыми, знаками табуляции и границами строк. Букву 'y' для простоты считать согласной (гласными или согласными бывают звуки, но не буквы). Необходимо проверить выполнение следующего условия: есть ли слова, начинающиеся и заканчивающиеся гласными? При решении задачи необходимо реализовать математическую абстракцию множества (сам тип, полное/пустое множество, пересечение, симметрическая разность и т.д.). Для реализации множества необходимо использовать битовые операции, но при этом запрещается нарушать принципы абстракции и инкапсуляции: пользовательский код должен зависеть только от интерфейса, но не от его реализации. При имплементации множеств можно считать, что все они имеют мощность не больше 32. Помимо обычных заголовочных файлов разрешается использовать ctype.h, inttypes.h и stdbool.h. Код функции main должен зависеть только от интерфейса АТД множество. Пояснения по тонким моментам: http://bit.ly/lab_13.

## 4. Оборудование

Процессор: AMD Ryzen 5 4600H with Radeon Graphics 3.00 GHz\
ОП: 16000 Мб\
НМД: 512 Гб\
Монитор: 1920x1080

## 5. Программное обеспечение

Операционная система семейства: **linux (ubuntu)**, версия **18.10 cosmic**\
Интерпретатор команд: **bash**, версия **4.4.19**.\
Система программирования: **--**, версия **--**\
Редактор текстов: **emacs**, версия **25.2.2**\
Утилиты операционной системы: **--**\
Прикладные системы и программы: **--**\
Местонахождение и имена файлов программ и данных на домашнем компьютере: **--**\

## 6. Идея, метод, алгоритм решения задачи

Если первая буква - гласная, то ставим true(1) в переменную first. Затем переходим в конец слова и смотрим на последнюю букву. Если гласная - выводим Yes и завершаем программу.
Символы представляем в виде множества. Все гласные буквы = 1065233.
Входной символ представляем в виде числа(логический сдвиг единицы на c - ‘a’ или c - ‘A’) и выполняем поразрядную коньюнкцию с числом 1065233. Если 0 - то, это не гласная буква, иначе - гласная.

## 7. Сценарий выполнения работы

| Входные данные | Выходные данные |
| -------------- | --------------- |
|amaretto|Yes|
|affectus sunt non levia|No|
|Help please aee|Yes|
|AvE MariA|Yes|


## 8. Распечатка протокола

```
#include<stdio.h>
typedef enum {
    S0, S1, S2
} State;

int is_separator(char c)
{
    if (c == ' ' || c == ',' || c == '\n' || c == 9) {
        return 1;
    }
    return 0;
}

int is_small(char c)
{
    if (c >= 'a' && c <= 'z') {
        return 1;
    }
    return 0;
}

int main(void)
{
    int vowelLetters = 1065233;
    char c;
    int first = 0;
    int last = 0;
    int sep = 0;
    State state = S0;
    int set = 0;
    while ((c = getchar()) != EOF) {
        if (!is_separator(c)) {
            if (is_small(c)) {
                set = 1 << (c - 'a');
            } else {
                set = 1 << (c - 'A');
            }
        }
        switch (state) {
            case S0:
                if (sep) {
                    if (last && first) {
                        printf("Yes\n");
                        return 0;
                    } else {
                        last = 0;
                        first = 0;
                        sep = 0;
                    }
                }
                if (vowelLetters & set) {
                    first = 1;
                }
                state = S1;
                break;
            case S1:
                if (is_separator(c)) {
                    if (vowelLetters & set) {
                        last = 1;
                    }
                    sep = 1;
                    state = S2;
                } else {
                    state = S1;
                }
                break;
            case S2:
                if (is_separator(c)) {
                    state = S2;
                } else {
                    if (last && first) {
                        printf("Yes\n");
                        return 0;
                    } else {
                        last = 0;
                        first = 0;
                        sep = 0;
                    }
                    if (vowelLetters & set) {
                        first = 1;
                    }
                    state = S1;
                }
        }
        if (last && first) {
            printf("Yes\n");
            return 0;
        }
    }
    printf("No\n");
    return 0;
}


```

## 9. Дневник отладки

## 10. Замечания автора по существу работы

Замечаний нет.

## 11. Выводы

Было интересно и познавательно.
